In [1]:
import pandas as pd

In [2]:
columns = ["Name", "Height", "Age"]
df = pd.DataFrame(columns=columns)
df

Empty DataFrame
Columns: [Name, Height, Age]
Index: []

In [3]:
df.loc[0] = ["Allen", 175, 22]
df

    Name  Height  Age
0  Allen     175   22

In [4]:
df.loc[1] = ["Ted", 180, 25]
df

    Name  Height  Age
0  Allen     175   22
1    Ted     180   25

In [5]:
df["Weight"] = [75, 80]
df

    Name  Height  Age  Weight
0  Allen     175   22      75
1    Ted     180   25      80

In [6]:
df.drop(["Weight"], axis=1)  # axis:方向

    Name  Height  Age
0  Allen     175   22
1    Ted     180   25

In [7]:
df

    Name  Height  Age  Weight
0  Allen     175   22      75
1    Ted     180   25      80

In [8]:
df = df.drop(["Weight"], axis=1)  # 丟掉欄位必須重新宣告才會記憶
df

    Name  Height  Age
0  Allen     175   22
1    Ted     180   25

In [9]:
df.drop(1)

    Name  Height  Age
0  Allen     175   22

In [10]:
df

    Name  Height  Age
0  Allen     175   22
1    Ted     180   25

In [11]:
df["Age"][1]

25

In [12]:
df["Age"][1] = 30  # 修改值
df

C:\Users\Tibame_EX14\AppData\Local\Temp\ipykernel_17064\699002272.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["Age"][1] = 30

    Name  Height  Age
0  Allen     175   22
1    Ted     180   30

In [13]:
df["Age"] = 28  # 修改欄位全部值
df

    Name  Height  Age
0  Allen     175   28
1    Ted     180   28

In [16]:
data = [
    ["Jack", 175, 30],
    ["Mary", 160, 25]
]
df2 = pd.DataFrame(data=data, columns=columns)
df2

   Name  Height  Age
0  Jack     175   30
1  Mary     160   25

In [17]:
df

    Name  Height  Age
0  Allen     175   28
1    Ted     180   28

In [18]:
df.append(df2)

C:\Users\Tibame_EX14\AppData\Local\Temp\ipykernel_17064\2094904254.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append(df2)

    Name  Height  Age
0  Allen     175   28
1    Ted     180   28
0   Jack     175   30
1   Mary     160   25

In [19]:
df3 = pd.concat([df, df2])
df3

    Name  Height  Age
0  Allen     175   28
1    Ted     180   28
0   Jack     175   30
1   Mary     160   25

In [20]:
df3.reset_index()  # 重置索引，保留舊的索引

   index   Name  Height  Age
0      0  Allen     175   28
1      1    Ted     180   28
2      0   Jack     175   30
3      1   Mary     160   25

In [22]:
df3 = df3.reset_index(drop=True)  # 重置索引，去除舊的索引
df3

    Name  Height  Age
0  Allen     175   28
1    Ted     180   28
2   Jack     175   30
3   Mary     160   25

In [23]:
df3['Name']  # Series dtype:object是字串的意思

0    Allen
1      Ted
2     Jack
3     Mary
Name: Name, dtype: object